#+TITLE: Signals implementations on Javascript
#+AUTHOR: Rahul M. Juliato
#+DATE: <2023-07-12 Qua>
#+OPTIONS: toc:nil

* Basic Signals
#+BEGIN_SRC js

  class Signal {
	constructor(initialValue) {
	  this._value = initialValue;
	  this._dependents = new Set();
	}

	get value() {
	  return this._value;
	}

	set value(newValue) {
	  if(this._value !== newValue) {
		this._value = newValue;
		this._notifyDependents();
	  }
	}

	_notifyDependents() {
	  for (const dependent of this._dependents) {
		dependent._update();
	  }
	}

	_addDependent(dependent) {
	  this._dependents.add(dependent);
	}

  }


  class Computed {
	constructor(computeFn, dependencies) {
	  this._computeFn = computeFn;
	  this._dependencies = dependencies;
	  this._value = undefined;
	  this._isStale = true;

	  for (const dependency of this._dependencies) {
	    dependency._addDependent(this);
	  }
	}

	get value() {
	  if (this._isStale) {
		  this._recomputeValue();
	  }
	  return this._value;
	}

	_recomputeValue() {
	  this._value = this._computeFn();
	  this._isStale = false;
	}

	_update() {
	  this._isStale = true;  
	}

	dispose() {
	  for (const dependency of this._dependencies) {
		dependency._removeDependent(this);
	  }
	}
  }

  function createSignal(initialValue) {
	return new Signal(initialValue);
  }

  function createComputed(computeFn, dependencies) {
	return new Computed(computeFn, dependencies);
  }

  const a = createSignal(0);
  const b = createSignal(2);

  const c = createComputed(() => a.value * b.value, [a, b]);

  console.log(c.value);

  a.value = 1;
  console.log(c.value);

  b.value = 3;
  console.log(c.value);

#+END_SRC

#+RESULTS:
: 0
: 2
: 3
: undefined

* Basic + Automatically tracking dependencies
#+BEGIN_SRC js

  let currentComputed = null;

  class Signal {
	constructor(initialValue) {
	  this._value = initialValue;
	  this._dependents = [];
	}

	get value() {
	  if (currentComputed) {
		this._addDependent(currentComputed);
	  }
	  return this._value;
	}

	set value(newValue) {
	  if(this._value !== newValue) {
		this._value = newValue;
		this._notifyDependents();
	  }
	}

	_notifyDependents() {
	  for (const dependent of this._dependents) {
		dependent._update();
	  }
	}

	_addDependent(computed) {
	  if (!this._dependents.includes(computed)) {
		this._dependents.push(computed);
	  }
	}

	_removeDependent(computed) {
	  this._dependents = this._dependents.filter((dep) => dep !== computed);
	}

  }


  class Computed {
	constructor(computeFn, dependencies) {
	  this._computeFn = computeFn;
	  this._dependencies = dependencies;
	  this._value = undefined;
	  this._isStale = true;
	}

	get value() {
	  if (this._isStale) {
		  currentComputed = this;
		  this._recomputeValue();
	      currentComputed = null;
	  }
	  return this._value;
	}

	_recomputeValue() {
	  this._value = this._computeFn();
	  this._isStale = false;
	}

	_update() {
	  this._isStale = true;  
	}
  }

  function createSignal(initialValue) {
	return new Signal(initialValue);
  }

  function createComputed(computeFn, dependencies) {
	return new Computed(computeFn, dependencies);
  }

  const a = createSignal(0);
  const b = createSignal(2);

  const c = createComputed(() => a.value * b.value);

  console.log(c.value);

  a.value = 1;
  console.log(c.value);

  b.value = 3;
  console.log(c.value);

#+END_SRC

#+RESULTS:
: 0
: 2
: 3
: undefined

* Effects
#+BEGIN_SRC js

  let currentAccessed = null;

  class Signal {
	constructor(initialValue) {
	  this._value = initialValue;
	  this._dependents = [];
	}

	get value() {
	  if (currentAccessed) {
		this._addDependent(currentAccessed);
	  }
	  return this._value;
	}

	set value(newValue) {
	  if(this._value !== newValue) {
		this._value = newValue;
		this._notifyDependents();
	  }
	}

	_notifyDependents() {
	  for (const dependent of this._dependents) {
		dependent._update();
	  }
	}

	_addDependent(computed) {
	  if (!this._dependents.includes(computed)) {
		this._dependents.push(computed);
	  }
	}

	_removeDependent(computed) {
	  this._dependents = this._dependents.filter((dep) => dep !== computed);
	}

  }


  class Computed {
	constructor(computeFn, dependencies) {
	  this._computeFn = computeFn;
	  this._dependencies = dependencies;
	  this._value = undefined;
	  this._isStale = true;
	}

	get value() {
	  if (this._isStale) {
		  currentAccessed = this;
		  this._recomputeValue();
		  currentAccessed = null;
	  }
	  return this._value;
	}

	_recomputeValue() {
	  this._value = this._computeFn();
	  this._isStale = false;
	}

	_update() {
	  this._isStale = true;  
	}
  }

  class Effect {
	constructor(effectFn) {
	  this._effectFn = effectFn;
	  this._isStale = true;
	  this._execute();
	}

	_execute() {
	  if (this._isStale) {
		currentAccessed = this;
		this._effectFn();
		currentAccessed = null;
	  }
	}

	_update() {
	  this._isStale = true;
	  this._execute();
	}
  }

  function createSignal(initialValue) {
	return new Signal(initialValue);
  }

  function createComputed(computeFn, dependencies) {
	return new Computed(computeFn, dependencies);
  }

  function createEffect(effectFn) {
	return new Effect(effectFn);
  }

  const a = createSignal(0);
  const b = createSignal(2);

  createEffect(() => {
	console.log(`Effect called: a is ${a.value} and b is ${b.value}`);
  });

  a.value = 1;
  b.value = 3;
  
#+END_SRC

#+RESULTS:
: Effect called: a is 0 and b is 2
: Effect called: a is 1 and b is 2
: Effect called: a is 1 and b is 3
: undefined

